In [2]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')   
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [4]:
titanic_train.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
146,147,1,3,"Andersson, Mr. August Edvard (""Wennerstrom"")",male,27.0,0,0,350043,7.7958,NaN,S
147,148,0,3,"Ford, Miss. Robina Maggie ""Ruby""",female,9.0,2,2,W./C. 6608,34.3750,NaN,S
148,149,0,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.0000,F2,S
149,150,0,2,"Byles, Rev. Thomas Roussel Davids",male,42.0,0,0,244310,13.0000,NaN,S
150,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.5250,NaN,S
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [5]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
titanic_train[['Name','Sex','Cabin','Embarked']].describe()

                              Name   Sex        Cabin Embarked
count                          156   156           31      155
unique                         156     2           28        3
top     Goodwin, Miss. Lillian Amy  male  C23 C25 C27        S
freq                             1   100            2      110

In [8]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [9]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [10]:
titanic_train.dtypes == "object"

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [11]:
titanic_train.dtypes == "int64"

PassengerId     True
Survived        True
Pclass          True
Name           False
Sex            False
Age            False
SibSp           True
Parch           True
Ticket         False
Fare           False
Cabin          False
Embarked       False
dtype: bool

In [12]:
a = titanic_train.dtypes[titanic_train.dtypes == "object"].index
a

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [13]:
titanic_train[a].describe()

                              Name   Sex   Ticket        Cabin Embarked
count                          156   156      156           31      155
unique                         156     2      145           28        3
top     Goodwin, Miss. Lillian Amy  male  CA 2144  C23 C25 C27        S
freq                             1   100        2            2      110

In [14]:
titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [15]:
titanic_train.dtypes[titanic_train.dtypes == "object"]

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [16]:
titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [17]:
titanic_train.dtypes[titanic_train.dtypes == "object"]

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [18]:
list_col = titanic_train.dtypes[titanic_train.dtypes == "object"].index
titanic_train[list_col].describe()

                              Name   Sex   Ticket        Cabin Embarked
count                          156   156      156           31      155
unique                         156     2      145           28        3
top     Goodwin, Miss. Lillian Amy  male  CA 2144  C23 C25 C27        S
freq                             1   100        2            2      110

In [19]:
titanic_train[titanic_train.dtypes[titanic_train.dtypes == "int64"].index].describe()

       PassengerId    Survived      Pclass       SibSp       Parch
count   156.000000  156.000000  156.000000  156.000000  156.000000
mean     78.500000    0.346154    2.423077    0.615385    0.397436
std      45.177428    0.477275    0.795459    1.056235    0.870146
min       1.000000    0.000000    1.000000    0.000000    0.000000
25%      39.750000    0.000000    2.000000    0.000000    0.000000
50%      78.500000    0.000000    3.000000    0.000000    0.000000
75%     117.250000    1.000000    3.000000    1.000000    0.000000
max     156.000000    1.000000    3.000000    5.000000    5.000000

In [20]:
titanic_train[['Name','Sex','Age']]

                                                  Name     Sex   Age
0                              Braund, Mr. Owen Harris    male  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                               Heikkinen, Miss. Laina  female  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                             Allen, Mr. William Henry    male  35.0
..                                                 ...     ...   ...
151                  Pears, Mrs. Thomas (Edith Wearne)  female  22.0
152                                   Meo, Mr. Alfonzo    male  55.5
153                    van Billiard, Mr. Austin Blyler    male  40.5
154                              Olsen, Mr. Ole Martin    male   NaN
155                        Williams, Mr. Charles Duane    male  51.0

[156 rows x 3 columns]

In [21]:
titanic_train['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
151                    Pears, Mrs. Thomas (Edith Wearne)
152                                     Meo, Mr. Alfonzo
153                      van Billiard, Mr. Austin Blyler
154                                Olsen, Mr. Ole Martin
155                          Williams, Mr. Charles Duane
Name: Name, Length: 156, dtype: object

In [22]:
sorted(titanic_train["Name"])[5:10:2]# Check the first 15 sorted names

['Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andrew, Mr. Edgardo Samuel',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)']

In [23]:
titanic_train["Name"].describe()

count                            156
unique                           156
top       Goodwin, Miss. Lillian Amy
freq                               1
Name: Name, dtype: object

In [24]:
type(titanic_train[["Ticket"]])

pandas.core.frame.DataFrame

In [25]:
titanic_train[['Fare','Pclass']].describe()

             Fare      Pclass
count  156.000000  156.000000
mean    28.109587    2.423077
std     39.401047    0.795459
min      6.750000    1.000000
25%      8.003150    2.000000
50%     14.454200    3.000000
75%     30.371850    3.000000
max    263.000000    3.000000

In [26]:
titanic_train[['Survived','Pclass']].sort_values

<bound method DataFrame.sort_values of      Survived  Pclass
0           0       3
1           1       1
2           1       3
3           1       1
4           0       3
..        ...     ...
151         1       1
152         0       3
153         0       3
154         0       3
155         0       1

[156 rows x 2 columns]>

In [27]:
tmp = titanic_train['Name']
for i in tmp:
    if i[0]== "S":
        print(i)

Sandstrom, Miss. Marguerite Rut
Saundercock, Mr. William Henry
Sloper, Mr. William Thompson
Spencer, Mrs. William Augustus (Marie Eugenie)
Samaan, Mr. Youssef
Sirayanian, Mr. Orsen
Skoog, Master. Harald
Stewart, Mr. Albert A
Staneff, Mr. Ivan
Sheerlinck, Mr. Jan Baptist
Slocovski, Mr. Selman Francis
Shorney, Mr. Charles Joseph
Salkjelsvik, Miss. Anna Kristine
Sobey, Mr. Samuel James Hayden

In [28]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [29]:
titanic_train[["Ticket"]][4:9]

   Ticket
4  373450
5  330877
6   17463
7  349909
8  347742

In [30]:
titanic_train["Ticket"].describe()
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [31]:
titanic_train["sudh"]="sdffs"
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sudh
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,sdffs
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,sdffs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,sdffs
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,sdffs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,sdffs

In [32]:
titanic_train["Cabin"][:15]     # Check the first 15 tickets

0      NaN
1      C85
2      NaN
3     C123
4      NaN
5      NaN
6      E46
7      NaN
8      NaN
9      NaN
10      G6
11    C103
12     NaN
13     NaN
14     NaN
Name: Cabin, dtype: object

In [33]:
titanic_train.dtypes# Check number of unique cabins

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
sudh            object
dtype: object

In [34]:
titanic_train["Survived"]

0      0
1      1
2      1
3      1
4      0
      ..
151    1
152    0
153    0
154    0
155    0
Name: Survived, Length: 156, dtype: int64

In [35]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'sudh'],
      dtype='object')

In [36]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [37]:
new_Pclass = pd.Categorical(titanic_train["Pclass"])

new_Pclass

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [38]:
new_Pclass = pd.Categorical(titanic_train["Pclass"])
new_Pclass

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [39]:
titanic_train["Cabin"].unique()   # Check unique cabins

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2'], dtype=object)

In [40]:
titanic_train["Pclass"].unique()

array([3, 1, 2], dtype=int64)

In [41]:
import numpy as np 
char_cabin = titanic_train["Cabin"].astype(str) # Convert data to str

new_Cabin = [cabin[0] for cabin in char_cabin] # Take first letter

new_Cabin = pd.Categorical(new_Cabin)
#new_Cabin
new_Cabin

[n, C, n, C, n, ..., C, n, n, n, n]
Length: 156
Categories (8, object): [A, B, C, D, E, F, G, n]

In [42]:
titanic_train["Cabin"] = new_Cabin
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sudh
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,n,S,sdffs
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C,sdffs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,n,S,sdffs
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S,sdffs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,n,S,sdffs

In [43]:
titanic_train["Age"].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154     True
155    False
Name: Age, Length: 156, dtype: bool

In [44]:
titanic_train["Age"].isnull() == True

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154     True
155    False
Name: Age, Length: 156, dtype: bool

In [45]:
missing = np.where(titanic_train["Age"].isnull() == True)
missing

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

In [64]:
max(titanic_train["Fare"])

263.0

In [66]:
#np.where is used to get the index
max_fare_index = np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))
max_fare_index

(array([27, 88], dtype=int64),)

In [69]:
titanic_train.iloc[max_fare_index][['Name','Sex']]

                              Name     Sex
27  Fortune, Mr. Charles Alexander    male
88      Fortune, Miss. Mabel Helen  female

In [47]:
titanic_train.iloc[np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sudh
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0,C,S,sdffs
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0,C,S,sdffs

In [89]:
np.where(titanic_train["Fare"]==min(titanic_train["Fare"]))

(array([143], dtype=int64),)

In [70]:
titanic_train['new_combined'] = titanic_train['PassengerId'] + titanic_train['Survived']

In [90]:
titanic_train.iloc[np.where(titanic_train["Fare"] == min(titanic_train["Fare"])) and np.where(titanic_train["Age"] == min(titanic_train["Age"]))][["Name","Age"]]

TypeError: unsupported operand type(s) for &: 'tuple' and 'tuple'

In [95]:
np.where((titanic_train["Age"] > 30 ) & (titanic_train["Fare"] == min(titanic_train["Fare"])))

(array([], dtype=int64),)

In [49]:
len(missing[0])

30

In [50]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]
titanic_train["Family"]
most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
most_family

(array([59, 71], dtype=int64),)

In [51]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]

most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
most_family
titanic_train.iloc[most_family]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sudh,Family
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,n,S,sdffs,7
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9,n,S,sdffs,7

In [96]:
import numpy as np
import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

print ("Labels:", labels)
print("My data:", my_data)
print("Dictionary:", d)
pd.Series(my_data, index=labels)

Labels: ['a', 'b', 'c']
My data: [10, 20, 30]
Dictionary: {'a': 10, 'b': 20, 'c': 30}

a    10
b    20
c    30
dtype: int64

In [53]:
#change the indices 
pd.Series(my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [101]:
print("\nHolding numerical data\n",'-'*25, sep='')
print(pd.Series(arr))
print(pd.Series(arr)[0])
print("*"*30)
print(pd.Series(arr, index=[5,6,7])[5])

Holding numerical data
-------------------------
0    10
1    20
2    30
dtype: int32
10
******************************
10

In [55]:
print ("\nHolding text labels\n",'-'*20, sep='')
print(pd.Series(labels))

Holding text labels
--------------------
0    a
1    b
2    c
dtype: object

In [106]:
d = {'a':"10",'b':20,'c':30}
print(pd.Series(d)[0])
print(pd.Series(d)['a'])

10
10

In [111]:
# converting dict into series 
print(pd.Series(d))
pd.Series(d, index = ['a','b','c'])[0]

a    10
b    20
c    30
dtype: object

'10'

In [117]:
pd.Series([5,6,7], index=['r','y',6])[0]

KeyError: 0

In [116]:
pd.Series([5,6,7], index=['r','y',6])['r']

5

In [121]:
pd.DataFrame(d,index = ['a','b','c'])

    a   b   c
a  10  20  30
b  10  20  30
c  10  20  30

In [56]:
d = {'a':"kjhk",'b':20,'c':30}
d.items
pd.DataFrame(d,index = ['a','b','c'])

      a   b   c
a  kjhk  20  30
b  kjhk  20  30
c  kjhk  20  30

In [57]:
print ("\nHolding objects from a dictionary\n",'-'*40, sep='')
print(pd.Series([type, sum, max]))

Holding objects from a dictionary
----------------------------------------
0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
dtype: object

In [122]:
pd.Series([type, sum, max])

0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
dtype: object

In [58]:
ser1 = pd.Series([1,2,3,4],index = [2,4,6,8])
ser2 = pd.Series([1,2,5,4],['CA', 'OR', 'NV', 'AZ'])
ser1

2    1
4    2
6    3
8    4
dtype: int64

In [59]:
ser1[0:3:2]

2    1
6    3
dtype: int64

In [125]:
ser1

2    1
4    2
6    3
8    4
dtype: int64

In [131]:
print ("\nIndexing by number (positional value in the series)\n",'-'*52, sep='')
print("Value for CA in ser1:", ser1[2])
#print("Value for AZ in ser1:", ser1[3])
#print("Value for NV in ser2:", ser2[2])
#ser1

Indexing by number (positional value in the series)
----------------------------------------------------
Value for CA in ser1: 1

In [ ]:
print ("\nIndexing by a range\n",'-'*25, sep='')
print ("Value for OR, CO, and AZ in ser1:\n", ser1[0:3:2], sep='')

In [132]:
#index wise summation of two series
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4],['CA', 'NV', 'AZ','OR'])
ser3 = ser1+ser2
ser3

AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

In [133]:
print ("\nAfter adding the two series, the result looks like this...\n",'-'*59, sep='')
print(ser3)
print("\nPython tries to add values where it finds common index name, and puts NaN where indices are missing\n")

After adding the two series, the result looks like this...
-----------------------------------------------------------
AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

Python tries to add values where it finds common index name, and puts NaN where indices are missing

In [134]:
print ("\nThe idea works even for multiplication...\n",'-'*43, sep='')
print (ser1*ser2)

The idea works even for multiplication...
-------------------------------------------
AZ    NaN
CA    1.0
CA    4.0
CO    NaN
NV    NaN
OR    8.0
dtype: float64

In [150]:
from numpy.random import randn as rn
np.random.seed(100)

In [160]:
#tmp = pd.DataFrame(rn(4,3), index=['a','b','c','d'],columns=['w','x','y'])
tmp = pd.DataFrame(rn(4,3), index=[4,5,6,7,],columns=['w','x','y'])

In [161]:
tmp

          w         x         y
4 -0.862227  1.249470 -0.079611
5 -0.889731 -0.881798  0.018639
6  0.237845  0.013549 -1.635529
7 -1.044210  0.613039  0.736205

In [163]:
#tmp.iloc[2] # iloc understands the integer location
tmp.loc[2]

KeyError: 2

In [ ]:
#iloc extract data from default index and loc extracts from a given index

In [197]:
from numpy.random import randn as rn
#np.random.seed(101)
matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(matrix_data,row_labels,column_headings)
#print("\nThe data frame looks like\n",'-'*45, sep='')
df

          W         X         Y         Z
A -0.578826 -1.199451 -1.705952  0.369164
B  1.876573 -0.376903  1.831936  0.003017
C -0.076023  0.003958 -0.185014 -2.487152
D -1.704651 -1.136261 -2.973315  0.033317
E -0.248889 -0.450176  0.132428  0.022214

In [164]:
df[['X','Y']]

          X         Y
A -1.690617 -1.356399
B -0.668172  0.007315
C -1.733096 -0.983310
D  1.470714 -1.188018
E -0.827932  0.108863

In [182]:
df["New_col"] = df['Y'] + df['Z']
df

          W         X         Y         Z   New_col
A  1.026921 -1.432191 -1.841188  0.366093 -1.475095
B -0.331777 -0.689218  2.034608 -0.550714  1.483893
C  0.750453 -1.306992  0.580573 -1.104523 -0.523950
D  0.690121  0.686890 -1.566688  0.904974 -0.661713
E  0.778822  0.428233  0.108872  0.028284  0.137156

In [167]:
df.iloc[2]

W          1.299748
X         -1.733096
Y         -0.983310
Z          0.357508
New_col   -0.625802
Name: C, dtype: float64

In [183]:
print("\nType of the pair of columns: ", type(df[['X','Z']]), sep='')
print ("\nSo, for more than one column, the object turns into a DataFrame")

Type of the pair of columns: <class 'pandas.core.frame.DataFrame'>

So, for more than one column, the object turns into a DataFrame

In [184]:
print("\nThe 'X' column accessed by DOT method (NOT recommended)\n",'-'*55, sep='')
print(df["X"])

The 'X' column accessed by DOT method (NOT recommended)
-------------------------------------------------------
A   -1.432191
B   -0.689218
C   -1.306992
D    0.686890
E    0.428233
Name: X, dtype: float64

In [185]:
print("\nA column is created by assigning it in relation to an existing column\n",'-'*75, sep='')
df['New'] = df['X']+df['Z']
df['New (Sum of X and Z)'] = df['X']+df['Z']
print(df)

A column is created by assigning it in relation to an existing column
---------------------------------------------------------------------------
          W         X         Y         Z   New_col       New  \
A  1.026921 -1.432191 -1.841188  0.366093 -1.475095 -1.066097
B -0.331777 -0.689218  2.034608 -0.550714  1.483893 -1.239932
C  0.750453 -1.306992  0.580573 -1.104523 -0.523950 -2.411515
D  0.690121  0.686890 -1.566688  0.904974 -0.661713  1.591864
E  0.778822  0.428233  0.108872  0.028284  0.137156  0.456517

   New (Sum of X and Z)
A             -1.066097
B             -1.239932
C             -2.411515
D              1.591864
E              0.456517

In [187]:
df

,W,X,Y,Z,New_col,New,New (Sum of X and Z)
A,1.026921,-1.432191,-1.841188,0.366093,-1.475095,-1.066097,-1.066097
B,-0.331777,-0.689218,2.034608,-0.550714,1.483893,-1.239932,-1.239932
C,0.750453,-1.306992,0.580573,-1.104523,-0.523950,-2.411515,-2.411515
D,0.690121,0.686890,-1.566688,0.904974,-0.661713,1.591864,1.591864
E,0.778822,0.428233,0.108872,0.028284,0.137156,0.456517,0.456517

In [188]:
df.drop('Y',axis=1)

          W         X         Z   New_col       New  New (Sum of X and Z)
A  1.026921 -1.432191  0.366093 -1.475095 -1.066097             -1.066097
B -0.331777 -0.689218 -0.550714  1.483893 -1.239932             -1.239932
C  0.750453 -1.306992 -1.104523 -0.523950 -2.411515             -2.411515
D  0.690121  0.686890  0.904974 -0.661713  1.591864              1.591864
E  0.778822  0.428233  0.028284  0.137156  0.456517              0.456517

In [189]:
df # we dropped Y but still we can see here

,W,X,Y,Z,New_col,New,New (Sum of X and Z)
A,1.026921,-1.432191,-1.841188,0.366093,-1.475095,-1.066097,-1.066097
B,-0.331777,-0.689218,2.034608,-0.550714,1.483893,-1.239932,-1.239932
C,0.750453,-1.306992,0.580573,-1.104523,-0.523950,-2.411515,-2.411515
D,0.690121,0.686890,-1.566688,0.904974,-0.661713,1.591864,1.591864
E,0.778822,0.428233,0.108872,0.028284,0.137156,0.456517,0.456517

In [191]:
df.drop('Y',axis=1,inplace= True) # dropping a column

KeyError: "['Y'] not found in axis"

In [192]:
df

          W         X         Z   New_col       New  New (Sum of X and Z)
A  1.026921 -1.432191  0.366093 -1.475095 -1.066097             -1.066097
B -0.331777 -0.689218 -0.550714  1.483893 -1.239932             -1.239932
C  0.750453 -1.306992 -1.104523 -0.523950 -2.411515             -2.411515
D  0.690121  0.686890  0.904974 -0.661713  1.591864              1.591864
E  0.778822  0.428233  0.028284  0.137156  0.456517              0.456517

In [193]:
# dropping a row # default axis is 0 which denotes row
df.drop('C')

          W         X         Z   New_col       New  New (Sum of X and Z)
A  1.026921 -1.432191  0.366093 -1.475095 -1.066097             -1.066097
B -0.331777 -0.689218 -0.550714  1.483893 -1.239932             -1.239932
D  0.690121  0.686890  0.904974 -0.661713  1.591864              1.591864
E  0.778822  0.428233  0.028284  0.137156  0.456517              0.456517

In [194]:
df

          W         X         Z   New_col       New  New (Sum of X and Z)
A  1.026921 -1.432191  0.366093 -1.475095 -1.066097             -1.066097
B -0.331777 -0.689218 -0.550714  1.483893 -1.239932             -1.239932
C  0.750453 -1.306992 -1.104523 -0.523950 -2.411515             -2.411515
D  0.690121  0.686890  0.904974 -0.661713  1.591864              1.591864
E  0.778822  0.428233  0.028284  0.137156  0.456517              0.456517

In [195]:
df.drop('C',inplace = True)

In [196]:
df

          W         X         Z   New_col       New  New (Sum of X and Z)
A  1.026921 -1.432191  0.366093 -1.475095 -1.066097             -1.066097
B -0.331777 -0.689218 -0.550714  1.483893 -1.239932             -1.239932
D  0.690121  0.686890  0.904974 -0.661713  1.591864              1.591864
E  0.778822  0.428233  0.028284  0.137156  0.456517              0.456517

In [ ]:
print("\nA column is dropped by using df.drop() method\n",'-'*55, sep=' ')
df.drop("C",inplace=True) # Notice the axis=1 option, axis = 0 is default, so one has to change it to 1

In [ ]:
df

In [ ]:
df1=df.drop('A')
print("\nA row (index) is dropped by using df.drop() method and axis=0\n",'-'*65, sep='')
print(df1)

In [ ]:
print("\nAn in-place change can be done by making inplace=True in the drop method\n",'-'*75, sep='')
df.drop('New (Sum of X and Z)', axis=1, inplace=True)
print(df)

In [ ]:
### Selecting/indexing Rows
#* Label-based 'loc' method
#* Index (numeric) 'iloc' method
df

##
LOC and ILOC

In [ ]:
print("\nLabel-based 'loc' method can be used for selecting row(s)\n",'-'*60, sep='')
print("\nSingle row\n")
print(df.iloc[3])

In [198]:
df

          W         X         Y         Z
A -0.578826 -1.199451 -1.705952  0.369164
B  1.876573 -0.376903  1.831936  0.003017
C -0.076023  0.003958 -0.185014 -2.487152
D -1.704651 -1.136261 -2.973315  0.033317
E -0.248889 -0.450176  0.132428  0.022214

In [201]:
#df.loc[['B','C']]['Z'] # 1st method
#2nd method
df.loc[['B','C'],['Z']]

          Z
B  0.003017
C -2.487152

In [203]:
df.loc[["B","D"],["W","Z"]]

          W         Z
B  1.876573  0.003017
D -1.704651  0.033317

In [204]:
df.loc[:,["W","Z"]]

          W         Z
A -0.578826  0.369164
B  1.876573  0.003017
C -0.076023 -2.487152
D -1.704651  0.033317
E -0.248889  0.022214

In [207]:
df.iloc[0,[2,3]]

Y   -1.705952
Z    0.369164
Name: A, dtype: float64

In [199]:
print("\nMultiple rows\n")
print(df.loc[['B','C']])

Multiple rows

          W         X         Y         Z
B  1.876573 -0.376903  1.831936  0.003017
C -0.076023  0.003958 -0.185014 -2.487152

In [208]:
print("\nIndex position based 'iloc' method can be used for selecting row(s)\n",'-'*70, sep='')
print("\nSingle row\n")
print(df.iloc[2])

Index position based 'iloc' method can be used for selecting row(s)
----------------------------------------------------------------------

Single row

W   -0.076023
X    0.003958
Y   -0.185014
Z   -2.487152
Name: C, dtype: float64

In [209]:
print("\nMultiple rows\n")
print(df.iloc[[1,2]])

Multiple rows

          W         X         Y         Z
B  1.876573 -0.376903  1.831936  0.003017
C -0.076023  0.003958 -0.185014 -2.487152

In [ ]:
#### Subsetting DataFrame

In [210]:

matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)

In [211]:
print("\nThe DatFrame\n",'-'*45, sep='')
print(df)

The DatFrame
---------------------------------------------
          W         X         Y         Z
A  0.317368 -0.752414 -1.296392  0.095139
B -0.423715 -1.185984 -0.365462 -1.271023
C  1.586171  0.693391 -1.958081 -0.134801
D -1.540616  2.046714 -1.396999 -1.097172
E -0.238713 -1.429067  0.949005 -0.019398

In [212]:
print("\nElement at row 'B' and column 'Y' is\n") 
print(df.loc[['B','C'],['Y','W']])

Element at row 'B' and column 'Y' is

          Y         W
B -0.365462 -0.423715
C -1.958081  1.586171

In [213]:
print("\nSubset comprising of rows B and D, and columns W and Y, is\n")
df.iloc[[1,2,3],[0,1]]

Subset comprising of rows B and D, and columns W and Y, is

          W         X
B -0.423715 -1.185984
C  1.586171  0.693391
D -1.540616  2.046714

In [214]:
print(df.loc[['B','C'],])

          W         X         Y         Z
B -0.423715 -1.185984 -0.365462 -1.271023
C  1.586171  0.693391 -1.958081 -0.134801

In [215]:
print("\nThe DataFrame\n",'-'*45, sep='')
print(df)

The DataFrame
---------------------------------------------
          W         X         Y         Z
A  0.317368 -0.752414 -1.296392  0.095139
B -0.423715 -1.185984 -0.365462 -1.271023
C  1.586171  0.693391 -1.958081 -0.134801
D -1.540616  2.046714 -1.396999 -1.097172
E -0.238713 -1.429067  0.949005 -0.019398

In [216]:
print("\nBoolean DataFrame(s) where we are checking if the values are greater than 0\n",'-'*75, sep='')
print(df>0)

Boolean DataFrame(s) where we are checking if the values are greater than 0
---------------------------------------------------------------------------
       W      X      Y      Z
A   True  False  False   True
B  False  False  False  False
C   True   True  False  False
D  False   True  False  False
E  False  False   True  False

In [217]:
print("\n")
print(df.loc[['A','B','C']]>0)

       W      X      Y      Z
A   True  False  False   True
B  False  False  False  False
C   True   True  False  False

In [ ]:
booldf = df>0
print("\nDataFrame indexed by boolean dataframe\n",'-'*45, sep='')
print(df[booldf])

In [218]:

import pandas as pd 
import numpy as np
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']
matrix_data

matrix([[ 22,  66, 140],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [219]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nA new DataFrame\n",'-'*25, sep='')
print(df)

A new DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [221]:
df['Height']>65

A     True
B     True
C    False
D     True
E    False
Name: Height, dtype: bool

In [226]:
df[(df['Height']>65) & (df['Weight'] <170)]

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [229]:
df[((df['Height']>65) | (df['Weight'] <170)) & (df['Age'] < 50)]

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [230]:
print("\nRows with Height > 65 inch\n",'-'*35, sep='')
print(df[df['Height']>65])

Rows with Height > 65 inch
-----------------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [231]:
df['Height']>65

A     True
B     True
C    False
D     True
E    False
Name: Height, dtype: bool

In [232]:
booldf1 = df['Height']>65
booldf2 = df['Weight']>145

In [233]:
print("\nRows with Height > 65 inch and Weight >145 lbs\n",'-'*55, sep='')
print(df[(booldf1) & (booldf2)])

Rows with Height > 65 inch and Weight >145 lbs
-------------------------------------------------------
   Age  Height  Weight
B   42      70     148
D   35      68     160

In [234]:
print("\nDataFrame with only Age and Weight columns whose Height > 65 inch\n",'-'*68, sep='')
print(df[booldf1][['Age','Weight']])

DataFrame with only Age and Weight columns whose Height > 65 inch
--------------------------------------------------------------------
   Age  Weight
A   22     140
B   42     148
D   35     160

In [235]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

In [236]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nThe DataFrame\n",'-'*25, sep='')
print(df)

The DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [238]:
print("\nAfter resetting index\n",'-'*35, sep='')
print(df.reset_index(drop=True))

After resetting index
-----------------------------------
   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

In [239]:
print("\nAfter resetting index with 'drop' option TRUE\n",'-'*45, sep='')
print(df.reset_index(drop=True))
"Student Teacher Engineer Doctor Nurse".split()

After resetting index with 'drop' option TRUE
---------------------------------------------
   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

['Student', 'Teacher', 'Engineer', 'Doctor', 'Nurse']

In [240]:
print("\nAdding a new column 'Profession'\n",'-'*45, sep='')
df['Profession'] = "Student Teacher Engineer Doctor Nurse".split()
print(df)

Adding a new column 'Profession'
---------------------------------------------
   Age  Height  Weight Profession
A   22      66     140    Student
B   42      70     148    Teacher
C   30      62     125   Engineer
D   35      68     160     Doctor
E   25      62     152      Nurse

In [242]:
print("\nSetting 'Profession' column as index\n",'-'*45, sep='')
print (df.set_index('Profession'))

Setting 'Profession' column as index
---------------------------------------------
            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Doctor       35      68     160
Nurse        25      62     152

In [243]:
#multi-indexing
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [244]:
print("\nTuple pairs after the zip and list command\n",'-'*45, sep='')
print(hier_index)

Tuple pairs after the zip and list command
---------------------------------------------
[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [252]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
print("\nIndex hierarchy\n",'-'*25, sep='')
print(hier_index)

Index hierarchy
-------------------------
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [253]:
print("\nIndex hierarchy type\n",'-'*25, sep='')
print(type(hier_index))

Index hierarchy type
-------------------------
<class 'pandas.core.indexes.multi.MultiIndex'>

In [254]:
print("\nCreating DataFrame with multi-index\n",'-'*37, sep='')
#np.random.seed(101)
df1 = pd.DataFrame(data=np.round(rn(6,3)), index= hier_index, columns= ['A','B','C'])
print(df1)

Creating DataFrame with multi-index
-------------------------------------
        A    B    C
G1 1  2.0 -1.0  0.0
   2  1.0 -2.0 -0.0
   3  0.0 -2.0  0.0
G2 1 -1.0 -0.0  2.0
   2  1.0 -0.0 -0.0
   3 -1.0 -1.0 -0.0

In [256]:
df1.loc['G1'].loc[3,["B","C"]]

B   -2.0
C    0.0
Name: 3, dtype: float64

In [257]:
df1.loc["G2"].iloc[1:,[0,1]]

     A    B
2  1.0 -0.0
3 -1.0 -1.0

In [ ]:
#cross tabulation like pivot table

In [249]:
print("\nGrabbing a cross-section from outer level\n",'-'*45, sep='')
print(df1.xs('G1'))

Grabbing a cross-section from outer level
---------------------------------------------
     A    B    C
1 -1.0  1.0  0.0
2 -0.0  2.0 -0.0
3  0.0  0.0 -0.0